app/controllers/admin/categories_controller.rb

SELECT "categories".* FROM "categories"
---
	def index
		@categories = Category.all

INSERT INTO "categories" ("title", "establishment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dsfsfsdfsdfs"], ["establishment_id", 1], ["created_at", "2017-10-10 11:09:59.124786"], ["updated_at", "2017-10-10 11:09:59.124786"]]
---
	def create
		@category = Category.new(categories_params)

		@category.save

DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 12]]
---
	def destroy
		@category = Category.destroy(params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@category = Category.find(params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "categories" SET "title" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["title", "Напитки Ninja Sushi"], ["updated_at", "2017-08-29 09:21:58.947023"], ["id", 9]]
---
	def update
		@category = Category.find(params[:id])
		if @category.update(categories_params)