app/controllers/admin/dishes_controller.rb

	def index
		@dishes = Dish.all
---
SELECT "dishes".* FROM "dishes"

	def create
		@dish = Dish.new(dishes_params)

		@dish.save
---
INSERT INTO "dishes" ("title", "price", "description", "establishment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Пицца"], ["price", 10.0], ["description", "Пицца, пицца, пицца"], ["establishment_id", 2], ["created_at", "2017-08-25 17:43:17.605211"], ["updated_at", "2017-08-25 17:43:17.605211"]]

	def destroy
		@dish = Dish.destroy(params[:id])
---
DELETE FROM "dishes" WHERE "dishes"."id" = ?  [["id", 1]]

	def edit
		@dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT 1  [["id", 5]]

	def update
		@dish = Dish.find(params[:id])
		if @dish.update(dishes_params)
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "dishes" SET "description" = ?, "category_id" = ?, "updated_at" = ? WHERE "dishes"."id" = ?  [["description", "Макиато кофеtyigik"], ["category_id", 9], ["updated_at", "2017-08-29 09:26:58.605586"], ["id", 38]]