app/controllers/admin/establishments_controller.rb

SELECT "establishments".* FROM "establishments"
---
	def index
		@establishments = Establishment.all

INSERT INTO "establishments" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dgbdb"], ["description", "dfbfdbdfbdffb"], ["created_at", "2017-08-28 06:47:16.770190"], ["updated_at", "2017-08-28 06:47:16.770190"]]
---
	def create
		@establishment = Establishment.new(establishments_params)

		if @establishment.save

DELETE FROM "establishments" WHERE "establishments"."id" = ?  [["id", 1]]
---
	def destroy
		@establishment = Establishment.destroy(params[:id])

SELECT  "establishments".* FROM "establishments" WHERE "establishments"."id" = ? LIMIT 1  [["id", 2]]
---
	def edit
		@establishment = Establishment.find(params[:id])

SELECT  "establishments".* FROM "establishments" WHERE "establishments"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "establishments" SET "description" = ?, "updated_at" = ? WHERE "establishments"."id" = ?  [["description", "Хотите утолить чувство голода и при этом сэкономить время и деньги? \r\nОнлайн заказ суши и роллов от Ninja Sushi!"], ["updated_at", "2017-08-28 07:36:19.517363"], ["id", 2]]
---
	def update
		@establishment = Establishment.find(params[:id])

		if @establishment.update(establishments_params)