app/views/admin/categories/_form.html.erb

SELECT "establishments".* FROM "establishments"
---
			<%= f.label :Заведение %><br>
			<%= f.collection_select :establishment_id, Establishment.all, :id, :title %>