app/controllers/carts_controller.rb

INSERT INTO "carts" ("status", "created_at", "updated_at") VALUES (?, ?, ?)  [["status", "new"], ["created_at", "2017-08-29 10:45:23.859429"], ["updated_at", "2017-08-29 10:45:23.859429"]]
---
	def create
    Cart.create!()