app/controllers/dishes_controller.rb

	def index
		@dishes = Dish.all
---
SELECT "dishes".* FROM "dishes"

	def show
		@dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT 1  [["id", 1]]