app/controllers/establishments_controller.rb

	def index
		@establishments = Establishment.all
---
SELECT "establishments".* FROM "establishments"

	def show
		@establishment = Establishment.find(params[:id])
---
SELECT  "establishments".* FROM "establishments" WHERE "establishments"."id" = ? LIMIT 1  [["id", 1]]