app/controllers/line_items_controller.rb

	def create
		@line_item = LineItem.new(line_items_params)
		if LineItem.where(user_id: current_user.id).length == 0
			@line_item.save
---
SELECT  "line_items".* FROM "line_items" WHERE "line_items"."user_id" = ?  ORDER BY "line_items"."id" DESC LIMIT 1  [["user_id", 1]]
INSERT INTO "line_items" ("title", "quantity", "price", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Foie gras"], ["quantity", 5], ["price", 900.0], ["cart_id", 1], ["created_at", "2017-08-28 15:29:51.508951"], ["updated_at", "2017-08-28 15:29:51.508951"]]

	def destroy
		@line_item = LineItem.destroy(params[:id])
---
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 8]]

	def destroy_all
		LineItem.delete_all "user_id = #{current_user.id}"
---
DELETE FROM "line_items" WHERE (user_id = 1)