app/views/line_items/_line_item.html.erb

	  	Корзина
	  	<span class="badge"><%= current_cart.line_items.count %></span>
---
SELECT "line_items".* FROM "line_items"
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 1]]