app/views/line_items/_line_item.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."user_id" = ?  [["user_id", 1]]
---
  </a>
  <% if LineItem.where(user_id: current_user.id).length == 0 then %>

SELECT title, sum(quantity) as quantity, sum(price) as price FROM "line_items" WHERE "line_items"."user_id" = ? GROUP BY "line_items"."title"  [["user_id", 1]]
---
        </tr>
            <% LineItem.select("title, sum(quantity) as quantity, sum(price) as price").where(user: current_user).group("title").each do |item_line| %>