app/views/establishments/show.html.erb

	<div class="col-md-12">
		<% @establishment.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."establishment_id" = ?  [["establishment_id", 6]]

				</tr>
				<% category.dishes.each do |dish|%>
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."establishment_id" = ?  [["establishment_id", 2]]