app/views/admin/dishes/_form.html.erb

			<%= f.label :Категория %><br>
			<%= f.collection_select :category_id, Category.all, :id, :title %>
---
SELECT "categories".* FROM "categories"